SoapRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.webserviceX.NET">
  <soap:Header />
  <soap:Body>
    <web:GetWeather>
      <!--Optional:-->
      <web:CityName>Manchester Airport</web:CityName>
      <!--Optional:-->
      <web:CountryName>United Kingdom</web:CountryName>
    </web:GetWeather>
  </soap:Body>
</soap:Envelope>