framework/data/getweather.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetWeather>
         <!--Optional:-->
         <web:CityName>Calcutta</web:CityName>
         <!--Optional:-->
         <web:CountryName>India</web:CountryName>
      </web:GetWeather>
   </soapenv:Body>
</soapenv:Envelope>